## Plan Result (ithc-global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;cft-api-mgmt&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
* Delete
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-sya&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc"
        name                                         = "hmcts-ithc"
        tags                                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (14 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-paymentoutcome-web" -> "healthProbeSettings-cft-api-mgmt"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/paymentoutcome-web"
          ~ load_balancing_name = "loadBalancingSettings-paymentoutcome-web" -> "loadBalancingSettings-cft-api-mgmt"
          ~ name                = "paymentoutcome-web" -> "cft-api-mgmt"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-cftithc.uksouth.cloudapp.azure.com" -> "firewall-nonprodi-palo-cftapimgmtithc.uksouth.cloudapp.azure.com"
              ~ host_header = "paymentoutcome-web.ithc.platform.hmcts.net" -> "cft-api-mgmt.ithc.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-plum" -> "healthProbeSettings-paymentoutcome-web"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/plum"
          ~ load_balancing_name = "loadBalancingSettings-plum" -> "loadBalancingSettings-paymentoutcome-web"
          ~ name                = "plum" -> "paymentoutcome-web"

          ~ backend {
              ~ host_header = "plum.ithc.platform.hmcts.net" -> "paymentoutcome-web.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-plum"
          + load_balancing_name = "loadBalancingSettings-plum"
          + name                = "plum"

          + backend {
              + address     = "firewall-nonprodi-palo-cftithc.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "plum.ithc.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/healthProbeSettings/healthProbeSettings-paymentoutcome-web"
          ~ name                = "healthProbeSettings-paymentoutcome-web" -> "healthProbeSettings-cft-api-mgmt"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/healthProbeSettings/healthProbeSettings-plum"
          ~ name                = "healthProbeSettings-plum" -> "healthProbeSettings-paymentoutcome-web"
            # (5 unchanged attributes hidden)
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-plum"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/loadBalancingSettings/loadBalancingSettings-paymentoutcome-web"
          ~ name                            = "loadBalancingSettings-paymentoutcome-web" -> "loadBalancingSettings-cft-api-mgmt"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/loadBalancingSettings/loadBalancingSettings-plum"
          ~ name                            = "loadBalancingSettings-plum" -> "loadBalancingSettings-paymentoutcome-web"
            # (3 unchanged attributes hidden)
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-plum"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      ~ frontend_endpoint {
          ~ host_name                               = "paymentoutcome-web.ithc.platform.hmcts.net" -> "cft-api-mgmt.ithc.platform.hmcts.net"
            id                                      = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/frontendEndpoints/paymentoutcome-web"
          ~ name                                    = "paymentoutcome-web" -> "cft-api-mgmt"
          ~ web_application_firewall_policy_link_id = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/paymentoutcomewebithc" -> "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/cftapimgmtithc"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "plum.ithc.platform.hmcts.net" -> "paymentoutcome-web.ithc.platform.hmcts.net"
            id                                      = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/frontendEndpoints/plum"
          ~ name                                    = "plum" -> "paymentoutcome-web"
          ~ web_application_firewall_policy_link_id = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/plumithc" -> "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/paymentoutcomewebithc"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "www.paymentoutcome-web.ithc.platform.hmcts.net" -> "plum.ithc.platform.hmcts.net"
            id                                      = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/frontendEndpoints/wwwpaymentoutcome-web"
          ~ name                                    = "wwwpaymentoutcome-web" -> "plum"
          + web_application_firewall_policy_link_id = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/plumithc"
            # (2 unchanged attributes hidden)
        }
      + frontend_endpoint {
          + host_name                    = "www.paymentoutcome-web.ithc.platform.hmcts.net"
          + name                         = "wwwpaymentoutcome-web"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }

      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paymentoutcome-web",
              + "cft-api-mgmt",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/paymentoutcome-web"
          ~ name               = "paymentoutcome-web" -> "cft-api-mgmt"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "paymentoutcome-web" -> "cft-api-mgmt"
              ~ cache_enabled                         = true -> false
                # (3 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "plum",
              + "paymentoutcome-web",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/plum"
          ~ name               = "plum" -> "paymentoutcome-web"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "plum" -> "paymentoutcome-web"
                # (4 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "div-dn",
              + "plum",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/div-dnHttpsRedirect"
          ~ name               = "div-dnHttpsRedirect" -> "plum"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "plum"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-da",
              + "div-dn",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/div-daHttpsRedirect"
          ~ name               = "div-daHttpsRedirect" -> "div-dnHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-rfe",
              + "div-da",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/div-rfeHttpsRedirect"
          ~ name               = "div-rfeHttpsRedirect" -> "div-daHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-pfe",
              + "div-rfe",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/div-pfeHttpsRedirect"
          ~ name               = "div-pfeHttpsRedirect" -> "div-rfeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-public",
              + "div-pfe",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/idam-web-publicHttpsRedirect"
          ~ name               = "idam-web-publicHttpsRedirect" -> "div-pfeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "civil-citizen-ui",
              + "idam-web-public",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/civil-citizen-uiHttpsRedirect"
          ~ name               = "civil-citizen-uiHttpsRedirect" -> "idam-web-publicHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cmc",
              + "civil-citizen-ui",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/cmcHttpsRedirect"
          ~ name               = "cmcHttpsRedirect" -> "civil-citizen-uiHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cmc-legal",
              + "cmc",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/cmc-legalHttpsRedirect"
          ~ name               = "cmc-legalHttpsRedirect" -> "cmcHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fact",
              + "cmc-legal",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/factHttpsRedirect"
          ~ name               = "factHttpsRedirect" -> "cmc-legalHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fact-admin",
              + "fact",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/fact-adminHttpsRedirect"
          ~ name               = "fact-adminHttpsRedirect" -> "factHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "rpts",
              + "fact-admin",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/rptsHttpsRedirect"
          ~ name               = "rptsHttpsRedirect" -> "fact-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "nfdiv",
              + "rpts",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/nfdivHttpsRedirect"
          ~ name               = "nfdivHttpsRedirect" -> "rptsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "nfdiv-apply",
              + "nfdiv",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/nfdiv-applyHttpsRedirect"
          ~ name               = "nfdiv-applyHttpsRedirect" -> "nfdivHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "nfdiv-civil",
              + "nfdiv-apply",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/nfdiv-civilHttpsRedirect"
          ~ name               = "nfdiv-civilHttpsRedirect" -> "nfdiv-applyHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "gateway-ccd",
              + "nfdiv-civil",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/gateway-ccdHttpsRedirect"
          ~ name               = "gateway-ccdHttpsRedirect" -> "nfdiv-civilHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "return-case-doc-ccd",
              + "gateway-ccd",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/return-case-doc-ccdHttpsRedirect"
          ~ name               = "return-case-doc-ccdHttpsRedirect" -> "gateway-ccdHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-approve-org",
              + "return-case-doc-ccd",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/xui-approve-orgHttpsRedirect"
          ~ name               = "xui-approve-orgHttpsRedirect" -> "return-case-doc-ccdHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-manage-org",
              + "xui-approve-org",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/xui-manage-orgHttpsRedirect"
          ~ name               = "xui-manage-orgHttpsRedirect" -> "xui-approve-orgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-register-org",
              + "xui-manage-org",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/xui-register-orgHttpsRedirect"
          ~ name               = "xui-register-orgHttpsRedirect" -> "xui-manage-orgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-webapp",
              + "xui-register-org",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/xui-webappHttpsRedirect"
          ~ name               = "xui-webappHttpsRedirect" -> "xui-register-orgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "ia-aip",
              + "xui-webapp",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/ia-aipHttpsRedirect"
          ~ name               = "ia-aipHttpsRedirect" -> "xui-webappHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "probate",
              + "ia-aip",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/probateHttpsRedirect"
          ~ name               = "probateHttpsRedirect" -> "ia-aipHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "pcq",
              + "probate",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/pcqHttpsRedirect"
          ~ name               = "pcqHttpsRedirect" -> "probateHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "lau",
              + "pcq",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/lauHttpsRedirect"
          ~ name               = "lauHttpsRedirect" -> "pcqHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paybubble",
              + "lau",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/paybubbleHttpsRedirect"
          ~ name               = "paybubbleHttpsRedirect" -> "lauHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "bar",
              + "paybubble",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/barHttpsRedirect"
          ~ name               = "barHttpsRedirect" -> "paybubbleHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fees-register",
              + "bar",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/fees-registerHttpsRedirect"
          ~ name               = "fees-registerHttpsRedirect" -> "barHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-admin",
              + "fees-register",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/idam-web-adminHttpsRedirect"
          ~ name               = "idam-web-adminHttpsRedirect" -> "fees-registerHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-user-dashboard",
              + "idam-web-admin",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/idam-user-dashboardHttpsRedirect"
          ~ name               = "idam-user-dashboardHttpsRedirect" -> "idam-web-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sscs-tribunals",
              + "idam-user-dashboard",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/sscs-tribunalsHttpsRedirect"
          ~ name               = "sscs-tribunalsHttpsRedirect" -> "idam-user-dashboardHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sscs-cor",
              + "sscs-tribunals",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/sscs-corHttpsRedirect"
          ~ name               = "sscs-corHttpsRedirect" -> "sscs-tribunalsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "adoption-web",
              + "sscs-cor",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/adoption-webHttpsRedirect"
          ~ name               = "adoption-webHttpsRedirect" -> "sscs-corHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "privatelaw",
              + "adoption-web",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/privatelawHttpsRedirect"
          ~ name               = "privatelawHttpsRedirect" -> "adoption-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmi-apim",
              + "privatelaw",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/hmi-apimHttpsRedirect"
          ~ name               = "hmi-apimHttpsRedirect" -> "privatelawHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paymentoutcome-web",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/paymentoutcome-webHttpsRedirect"
          ~ name               = "paymentoutcome-webHttpsRedirect" -> "hmi-apimHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "plum",
              + "cft-api-mgmt",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/plumHttpsRedirect"
          ~ name               = "plumHttpsRedirect" -> "cft-api-mgmtHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ accepted_protocols = [
                "Http",
              - "Https",
            ]
          ~ frontend_endpoints = [
              - "wwwpaymentoutcome-web",
              + "paymentoutcome-web",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/paymentoutcome-webwwwRedirect"
          ~ name               = "paymentoutcome-webwwwRedirect" -> "paymentoutcome-webHttpsRedirect"
            # (2 unchanged attributes hidden)

          ~ redirect_configuration {
              - custom_host       = "paymentoutcome-web.ithc.platform.hmcts.net" -> null
                # (2 unchanged attributes hidden)
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "plum",
            ]
          + name               = "plumHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwpaymentoutcome-web",
            ]
          + name               = "paymentoutcome-webwwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "paymentoutcome-web.ithc.platform.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (170 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["cft-api-mgmt"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/frontendEndpoints/cft-api-mgmt"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["et-sya"] will be destroyed
  # (because key ["et-sya"] is not in for_each map)
  - resource "azurerm_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [] -> null
      - id                                = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/etsyaithc" -> null
      - location                          = "global" -> null
      - mode                              = "Detection" -> null
      - name                              = "etsyaithc" -> null
      - resource_group_name               = "lz-ithc-rg" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Medium"
          - "environment"  = "ithc"
        } -> null

      - managed_rule {
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1271,"Program":"tfcmt","SHA1":"","Target":"ithc-global","Vars":{}} -->